"""6. *Реализовать структуру данных «Товары». Она должна представлять собой список кортежей. Каждый кортеж хранит
информацию об отдельном товаре. В кортеже должно быть два элемента — номер товара и словарь с параметрами (
характеристиками товара: название, цена, количество, единица измерения). Структуру нужно сформировать программно,
т.е. запрашивать все данные у пользователя.

Пример готовой структуры:

[
    (1, {“название”: “компьютер”, “цена”: 20000, “количество”: 5, “eд”: “шт.”}),
    (2, {“название”: “принтер”, “цена”: 6000, “количество”: 2, “eд”: “шт.”}),
    (3, {“название”: “сканер”, “цена”: 2000, “количество”: 7, “eд”: “шт.”})
]

Необходимо собрать аналитику о товарах. Реализовать словарь, в котором каждый ключ — характеристика товара,
например название, а значение — список значений-характеристик, например список названий товаров. Пример:

{
“название”: [“компьютер”, “принтер”, “сканер”],
“цена”: [20000, 6000, 2000],
“количество”: [5, 2, 7],
“ед”: [“шт.”]
}"""

dict_fields = {"название": str, "цена": float, "количество": int, "eд": str}
decimal_types = [int, float]

continue_commands = ['y', 'д']
exit_commands = ['n', 'н']
commands = continue_commands + exit_commands

my_list = []
while True:
    input_dict = {}

    for key, value in dict_fields.items():
        user_input = input(f"Введите следующую характеристику - {key}: ")

        if value in decimal_types:
            while not user_input.isdigit():
                user_input = input("Введите число: ")
            user_input = value(user_input)

        input_dict[key] = user_input

    my_list.append(input_dict)

    choice = input("Вы желаете ввести еще один товар: (Д/н)? ")

    while choice.lower() not in commands:
        choice = input("Не поняяяяятно: ")

    if choice.lower() in exit_commands:
        my_list = [item for item in enumerate(my_list)]
        break

print(f"Список товаров: {my_list}")

# This can be used for the testing
# my_list = [
#    (1, {"название": "компьютер", "цена": 20000, "количество": 5, "eд": "шт."}),
#    (2, {"название": "принтер", "цена": 6000, "количество": 2, "eд": "шт."}),
#    (3, {"название": "сканер", "цена": 2000, "количество": 7, "eд": "шт."})
# ]

my_dict = {}
for item in list(zip(*my_list))[1]:
    for key, value in item.items():
        if key in my_dict:
            my_dict[key] += [value]
        else:
            my_dict[key] = [value]

print(f"Аналитика: {my_dict}")
